app/controllers/leagues_controller.rb

  def index
    @leagues = League.all
---
SELECT `leagues`.* FROM `leagues`

  def create
    @league = League.new(league_params)

    respond_to do |format|
      if @league.save
---
INSERT INTO `leagues` (`title`, `description`, `division_1`, `division_2`, `division_3`, `division_4`, `division_5`, `coach_id`, `created_at`, `updated_at`) VALUES ('Coach1 League 1', '', 1, 1, 1, 1, 1, 0, '2015-11-01 14:43:11', '2015-11-01 14:43:11')

  def update
    respond_to do |format|
      if @league.update(league_params)
---
UPDATE `leagues` SET `division_5` = 4, `updated_at` = '2015-10-24 20:23:27' WHERE `leagues`.`id` = 1

  def destroy
    @league.destroy
---
DELETE FROM `leagues` WHERE `leagues`.`id` = 1

    def set_league
      @league = League.find(params[:id])
---
SELECT  `leagues`.* FROM `leagues` WHERE `leagues`.`id` = 1 LIMIT 1