app/controllers/password_resets_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'rajkrjha@hotmail.com' LIMIT 1
---
def create
  user = User.find_by_email(params[:email])

SELECT  `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'l97MkNA5PMYvU68OXNCLoA' LIMIT 1
---
def edit
  @user = User.find_by_password_reset_token!(params[:id])

SELECT  `users`.* FROM `users` WHERE `users`.`password_reset_token` = 'l97MkNA5PMYvU68OXNCLoA' LIMIT 1
UPDATE `users` SET `password_salt` = '$2a$10$nUSNdPCMcuychzkqroUYKu', `password_hash` = '$2a$10$nUSNdPCMcuychzkqroUYKu3SzyRAv1oFhyquJzb6Iu.QBbGBQXayC', `updated_at` = '2015-11-01 09:48:27' WHERE `users`.`id` = 1
---
def update
  @user = User.find_by_password_reset_token!(params[:id])
  paramm = params.has_key?(:coach) ? coach_params : parent_params
  @user.attributes = paramm
  @user.is_pass_reset = true
  if @user.password_reset_sent_at < 2.hours.ago
    redirect_to new_password_reset_path, :alert => "Password reset has expired."
  elsif @user.save