app/controllers/players_controller.rb

  def index
    @players = Player.all
---
SELECT `players`.* FROM `players`

  def create
    @player = Player.new(player_params)

    respond_to do |format|
      if @player.save
---
INSERT INTO `players` (`first_name`, `last_name`, `dob`, `debut`, `height`, `weight`, `coach_id`, `postal_code`, `rank`, `team_id`, `created_at`, `updated_at`) VALUES ('coach 1 league 1 team 1 player', '1', '17/01/1984', '17/01/1998', '23', '34', 1, '12345', 1, 1, '2015-11-01 15:12:20', '2015-11-01 15:12:20')

  def destroy
    @player.destroy
---
DELETE FROM `players` WHERE `players`.`id` = 1

    def set_player
      @player = Player.find(params[:id])
---
SELECT  `players`.* FROM `players` WHERE `players`.`id` = 1 LIMIT 1