app/controllers/teams_controller.rb

  def index
    @teams = Team.all
---
SELECT `teams`.* FROM `teams`

  def create
    @team = Team.new(team_params)

    respond_to do |format|
      if @team.save
---
INSERT INTO `teams` (`name`, `division`, `location`, `debut`, `coach_id`, `league_id`, `created_at`, `updated_at`) VALUES ('coach 1 team 1', 'division_1', 'Noida', '17/01/1908', 1, 1, '2015-11-01 15:10:54', '2015-11-01 15:10:54')

  def destroy
    @team.destroy
---
DELETE FROM `teams` WHERE `teams`.`id` = 3

    def set_team
      @team = Team.find(params[:id])
---
SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 5 LIMIT 1