app/controllers/users_controller.rb

SELECT  `users`.* FROM `users` WHERE `users`.`auth_token` = 'HtmaFd5DkTKSYfcv_qjIww' LIMIT 1
---
def show
  @user = User.find_by_auth_token(cookies[:auth_token]) unless cookies[:auth_token].nil?