app/controllers/users_controller.rb

INSERT INTO `users` (`email`, `dob`, `first_name`, `last_name`, `postal_code`, `yrs_coached`, `affiliation`, `type`, `password_salt`, `password_hash`, `created_at`, `updated_at`, `auth_token`) VALUES ('rajkrjha@hotmail.com', '17/01/1984', 'coach', '1', 12345, 12.0, 'club1', 'Coach', '$2a$10$jsEZicqwBEwBaDiv7hpEG.', '$2a$10$jsEZicqwBEwBaDiv7hpEG.TRXYgITquFLc5Kp3dStdPfD48Z1Wzfm', '2015-11-01 10:42:23', '2015-11-01 10:42:23', 'YuSXUe1vM9xAifuC-x3_qg')
---
def create
  #if user checks the "Are you a coach" checkbox then we treat it as coach and save it as coach.Here "Single table Inheritence" comes in picture.
  if user_params[:is_a_coach].to_s == "1" #create a coach
    @user = User.new(user_params)
    @user.type = "Coach"
  else
    @user = User.new(user_params) #create a parent
    @user.type = "Parent"
  end
  if @user.save

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
def show
  @user = User.find_by_id(session[:user_id]) unless session[:user_id].nil?